package org.example;
/*
Напишите метод, которому в качестве параметра передается целое число.
Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
Замечание: ноль считаем положительным числом
 */
public class Lesson1_7 {
    public static void main(String[] args) {
        int g = -4;
        boolean f = g < 0;
        System.out.println(f);
    }
}
